- Data Definition Language(DDL)
     - CREATE
     - ALTER
     - DROP
     - TRUNCATE
     - change structure of table
     - it permanantly changes/automatically saves

- Data Manipulation Language (DML)
  - SELECT(DQL)
  - UPDATE
  - DELETE
  - INSERT

- Data Control Language(DCL)
  - Grant
  - Revoke

- Transaction Control Language
    - Commit
    - Rollback

SELECT column1,column2... <br>
FROM table_name <br>
WHERE condition1,condition2..<br>
GROUP BY column1,column2..<br>
HAVING condition1,condition2..<br>
ORDER BY column1,column2<br>

#### data types
![data types](images/sql_data_types.png)

![operators](images/operators.png)

### ER DIAGRAM

- structural design of the database.
- specialized symbols to define the relationship between entities
- created based on 3 Main components
     - Entities
     - Attributes
     - Relationships

 ![er diagram](images/erd.png)

-  rectangle - > entity
-  oval -> attribute
-  double rectangle  -> weak entity
-  dashed oval  ->  derived attribute
-  diamond  -> relationship
-  double oval  -> multivalued attribute

- weak entity
   - that relies over another entity

- Attributes
   -  key
   - composite 
   - multi values
   - Derived

 ![composite attributes](images/comp.png)

#### commands

- show data bases;
- use data_base_name;
- show tables;
- select * from table_name;

In [ ]:
create table Person 
 (person_id int,
 FirstName varchar(255),
 lastName varchar(255));

In [ ]:
insert into Person 
values (1,'john','lee');

In [ ]:
select * from Persons where FirstName = 'john'

In [ ]:
select FirstName from Person ;

### download sql SERVER 2022 EXPRESS edition of sql server

- install basic
-

In [ ]:
select abs(-22);
select mod(10,4);
select mod(10,4) as remainder;
select power(4,2);
select power(10,3);
select sqrt(16);
select greatest(2,5,7,83,23,42,5);
select least(1,3,4,2,3,5,34,5);
select truncate (22.8972,1);  --truncated up to 1 decimal places

In [ ]:
select round(22.784); --next highest
select round(22.2324,2);

In [ ]:
insert into students values 
(12,'jos',23),
(13,'raj',23),
(14,'jane',24);

In [ ]:
select * from students where name='jane' and age=23;

In [ ]:
select city,count(student_id) as total_students 
from students group by city;

In [ ]:
select city,count(student_id) as total_students
from students group by city
having count(student_id) > 3;

In [ ]:
select * from students order by city;
select * from students order by city desc;

#### string operations

In [ ]:
select upper('india') as up;
select lower('IND') as lower;
select lcase('IND') as lower;
select character_length('india') as tot_len;

select character_length(stud_name) as tot_len
from students;

In [ ]:
--chara_length
--concat
select concat ("india" ,"is ","in asia") as sent;
select reverse("india");
select replace("orange is a vegitabel","vegitable","fruit");
select ltrim("        left drop      ");
-- rtrim
select position ("fruit" in "orange is a fruit ")as name;
select ascii(4);

In [ ]:
CREATE TABLE employee_table(
    emp_id INTEGER NOT NULL,
    emp_name CHAR(150) NOT NULL,
    emp_add VARCHAR(500) DEFAULT NULL,
    PRIMARY KEY (emp_id)
);

In [ ]:
INSERT INTO employee_table (emp_id,emp_name,emp_add)
VALUES
(1,"SASA","ADDDRE1");

In [ ]:
CREATE DATABASE IF NOT EXISTS simplilearn_db;

In [ ]:
CREATE TABLE dup_table SELECT DISTINCT * FROM employee_table;
DROP TABLE dup_table;
SELECT DISTINCT * FROM employee_table;
ALTER TABLE dup_table RENAME TO second_table;
TRUNCATE TABLE second_table;

- Removes all rows from a table  It is typically faster than a DELETE.

- It's fast and doesn't log every row deletion (which makes it faster).

In [ ]:
DELETE T1 FROM employee_table T1
INNER JOIN employee_table_1 T2
WHERE T1.emp_id > T2.emp_id ;

ALTER TABLE employee_table 
ADD COLUMN phone_number VARCHAR(15) NOT NULL DEFAULT 'N/A';

In [ ]:
SELECT * FROM employee_table
GROUP BY salary
ORDER BY salary DESC LIMIT N-1,1;

In [ ]:
CREATE VIEW view_stu AS
SELECT * FROM students
WHERE place='kerala' ;

- A view in SQL is essentially a virtual table that provides a way to represent data from one or more tables in a specific, often simplified, format. It doesn't store data itself but instead shows data dynamically based on a query you define when you create the view.

In [ ]:
CREATE VIEW customer_order_summary AS
SELECT customers.name, orders.order_date, SUM(order_items.amount) AS total_spent
FROM customers
JOIN orders ON customers.customer_id = orders.customer_id
JOIN order_items ON orders.order_id = order_items.order_id
GROUP BY customers.name, orders.order_date;

- a temporary table in sql is a special table that has no permanent storage allocated in the sql databases. a temporary table in sql has existence until the database session is active

In [ ]:
CREATE TEMPORARY TABLE table_name (parameters);

- Temporary tables in SQL are used to store data temporarily during the execution of a session or a specific query. They are very useful for intermediate storage, especially when you need to manipulate or process data that doesn't need to be permanently stored in the database.

### Intermediate Storage for Complex Queries
- Problem: When working with complex queries that require multiple joins, aggregations, or calculations, it can become difficult to work with the results directly in a single query.
- Solution: Temporary tables allow you to break down complex queries into smaller, manageable steps. You can store intermediate results in a temporary table and then perform further operations on them.

In [ ]:
UPDATE TABLE table_name (
    SET COLUMN_NAME = Parameter,
    WHERE CONDITION
);

In [ ]:
ALTER TABLE table_name
DROP COLUMN column_name;

In [ ]:
SELECT GETDATE();
SELECT CURDATE();

In [ ]:
DESC table_name;

In [ ]:
ALTER TABLE table_name
MODIFY column_name DATATYPE;

In [ ]:
ALTER TABLE employe_table
MODIFY pincode INTEGER;

In [ ]:
ALTER TABLE table_name
RENAME COLUMN old_name to new_name;

In [ ]:
SELECT parameters FROM table_name
GROUP BY parameters;

In [ ]:
SELECT department,AVG(salary) FROM employe_table
GROUP BY department 
ORDER BY salary DESC;

In [ ]:
SELECT * FROM employe_table
WHERE salary BETWEEN 10000 AND 20000;

In [ ]:
SELECT * FROM table_name
WHERE column_name LIKE 'constraints';

In [ ]:
DELETE with Inner Join and where clause
DELETE with Distinct COMMAND

In [ ]:
DELETE T1 FROM emp T1
INNER JOIN emp1 T2
WHERE T1.emp_id > T2.emp_id ;

### Normalization in DBMS

- aims to eliminate redundant(duplicate) data and ensures data is stored logically
- eliminates unwanted characteristics like insertion,update ,and deletion anomalies

- primary key
- foreign key
- super key is a set of one or more key ,used to identify record uniquely
- a candidate key is the minimal super key that can identify a record uniquely
- each candidate key can work as a primary key

### 1nf
    - each table cell should contain a single value
    - each record need to be unique